_wiki/2015-07-31-keyboard-oriented-setup.html
---
collections: wiki
layout: post
title: Keyboard Oriented Setup
date: 2015-07-31
categories: 
-
tags: 
- keyboard
- tools
author: carltonf
excerpt: Tools and configurations for a keyboard oriented setup.
---
<p>
It's highly recommended to use <b>ratpoison</b> or <b>stumpwm</b>. However, the following
should work on any desktop environment (e.g. Gnome and KDE)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Tools</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>xwrits</code> - reminds you to take wrist breaks

<p>
well, in case you don't have <b>workrave</b> or <b>RSIBreak</b>
</p>

<p>
<b>Update:</b> Recent years, I've used a Android app <a href="https://f-droid.org/repository/browse/?fdfilter=bodhi&fdid=org.yuttadhammo.BodhiTimer">BodhiTimer</a> to keep track the
time. It's simple, elegant and open source.
</p>
</li>

<li><code>xbindkeys</code> - a key-grabbing program for X

<p>
can be used to define combination keys that simulate behaviors of <b>ratpoison</b>
</p>
</li>

<li><code>dmenu</code> - dynamic menu (includes dmenu<sub>run</sub>, and dmenu<sub>path</sub>)

<p>
open program through keystrokes
</p>
</li>

<li><code>xmodmap</code> - utility for modifying keymaps and pointer button mappings in X

<p>
Emacs key (make enter and cap ctrls)
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Some old Configurations</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/carltonf/configurations/tree/master/keyoriented">Old and not used for a while</a> (kept as a reference)
</p>

<p>
<b>NOTE</b>: GNU <code>Guile</code> is required to configure <code>xbindkeys</code> for more advanced
features.
</p>
</div>
</div>
